{
    "class_name": "Functional",
    "config": {
        "name": "model_169",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        null,
                        null,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_71"
                },
                "name": "input_71",
                "inbound_nodes": []
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "block1_conv1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "block1_conv1",
                "inbound_nodes": [
                    [
                        [
                            "input_71",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "block1_conv2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "block1_conv2",
                "inbound_nodes": [
                    [
                        [
                            "block1_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "block1_pool",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "name": "block1_pool",
                "inbound_nodes": [
                    [
                        [
                            "block1_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "block2_conv1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "block2_conv1",
                "inbound_nodes": [
                    [
                        [
                            "block1_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "block2_conv2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "block2_conv2",
                "inbound_nodes": [
                    [
                        [
                            "block2_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "block2_pool",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "name": "block2_pool",
                "inbound_nodes": [
                    [
                        [
                            "block2_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "block3_conv1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "block3_conv1",
                "inbound_nodes": [
                    [
                        [
                            "block2_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "block3_conv2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "block3_conv2",
                "inbound_nodes": [
                    [
                        [
                            "block3_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "block3_conv3",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "block3_conv3",
                "inbound_nodes": [
                    [
                        [
                            "block3_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "block3_conv4",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "block3_conv4",
                "inbound_nodes": [
                    [
                        [
                            "block3_conv3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "block3_pool",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "name": "block3_pool",
                "inbound_nodes": [
                    [
                        [
                            "block3_conv4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "block4_conv1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "block4_conv1",
                "inbound_nodes": [
                    [
                        [
                            "block3_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "block4_conv2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "block4_conv2",
                "inbound_nodes": [
                    [
                        [
                            "block4_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "block4_conv3",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "block4_conv3",
                "inbound_nodes": [
                    [
                        [
                            "block4_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "block4_conv4",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "block4_conv4",
                "inbound_nodes": [
                    [
                        [
                            "block4_conv3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "block4_pool",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "name": "block4_pool",
                "inbound_nodes": [
                    [
                        [
                            "block4_conv4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "block5_conv1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "block5_conv1",
                "inbound_nodes": [
                    [
                        [
                            "block4_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "block5_conv2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "block5_conv2",
                "inbound_nodes": [
                    [
                        [
                            "block5_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "block5_conv3",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "block5_conv3",
                "inbound_nodes": [
                    [
                        [
                            "block5_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "block5_conv4",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "block5_conv4",
                "inbound_nodes": [
                    [
                        [
                            "block5_conv3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "block5_pool",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "name": "block5_pool",
                "inbound_nodes": [
                    [
                        [
                            "block5_conv4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "fpn_stage_p5_pre_conv",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "HeUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "fpn_stage_p5_pre_conv",
                "inbound_nodes": [
                    [
                        [
                            "block5_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "UpSampling2D",
                "config": {
                    "name": "fpn_stage_p5_upsampling",
                    "trainable": true,
                    "dtype": "float32",
                    "size": [
                        2,
                        2
                    ],
                    "data_format": "channels_last",
                    "interpolation": "nearest"
                },
                "name": "fpn_stage_p5_upsampling",
                "inbound_nodes": [
                    [
                        [
                            "fpn_stage_p5_pre_conv",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "fpn_stage_p5_conv",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "HeUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "fpn_stage_p5_conv",
                "inbound_nodes": [
                    [
                        [
                            "block5_conv4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add",
                "config": {
                    "name": "fpn_stage_p5_add",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "fpn_stage_p5_add",
                "inbound_nodes": [
                    [
                        [
                            "fpn_stage_p5_upsampling",
                            0,
                            0,
                            {}
                        ],
                        [
                            "fpn_stage_p5_conv",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "UpSampling2D",
                "config": {
                    "name": "fpn_stage_p4_upsampling",
                    "trainable": true,
                    "dtype": "float32",
                    "size": [
                        2,
                        2
                    ],
                    "data_format": "channels_last",
                    "interpolation": "nearest"
                },
                "name": "fpn_stage_p4_upsampling",
                "inbound_nodes": [
                    [
                        [
                            "fpn_stage_p5_add",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "fpn_stage_p4_conv",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "HeUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "fpn_stage_p4_conv",
                "inbound_nodes": [
                    [
                        [
                            "block4_conv4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add",
                "config": {
                    "name": "fpn_stage_p4_add",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "fpn_stage_p4_add",
                "inbound_nodes": [
                    [
                        [
                            "fpn_stage_p4_upsampling",
                            0,
                            0,
                            {}
                        ],
                        [
                            "fpn_stage_p4_conv",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "UpSampling2D",
                "config": {
                    "name": "fpn_stage_p3_upsampling",
                    "trainable": true,
                    "dtype": "float32",
                    "size": [
                        2,
                        2
                    ],
                    "data_format": "channels_last",
                    "interpolation": "nearest"
                },
                "name": "fpn_stage_p3_upsampling",
                "inbound_nodes": [
                    [
                        [
                            "fpn_stage_p4_add",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "fpn_stage_p3_conv",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "HeUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "fpn_stage_p3_conv",
                "inbound_nodes": [
                    [
                        [
                            "block3_conv4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add",
                "config": {
                    "name": "fpn_stage_p3_add",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "fpn_stage_p3_add",
                "inbound_nodes": [
                    [
                        [
                            "fpn_stage_p3_upsampling",
                            0,
                            0,
                            {}
                        ],
                        [
                            "fpn_stage_p3_conv",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "UpSampling2D",
                "config": {
                    "name": "fpn_stage_p2_upsampling",
                    "trainable": true,
                    "dtype": "float32",
                    "size": [
                        2,
                        2
                    ],
                    "data_format": "channels_last",
                    "interpolation": "nearest"
                },
                "name": "fpn_stage_p2_upsampling",
                "inbound_nodes": [
                    [
                        [
                            "fpn_stage_p3_add",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "fpn_stage_p2_conv",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "HeUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "fpn_stage_p2_conv",
                "inbound_nodes": [
                    [
                        [
                            "block2_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add",
                "config": {
                    "name": "fpn_stage_p2_add",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "fpn_stage_p2_add",
                "inbound_nodes": [
                    [
                        [
                            "fpn_stage_p2_upsampling",
                            0,
                            0,
                            {}
                        ],
                        [
                            "fpn_stage_p2_conv",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "segm_stage3a_conv",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "HeUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "segm_stage3a_conv",
                "inbound_nodes": [
                    [
                        [
                            "fpn_stage_p3_add",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
