{
    "class_name": "Functional",
    "config": {
        "name": "model_173",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        null,
                        null,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "data"
                },
                "name": "data",
                "inbound_nodes": []
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "bn_data",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 2e-05,
                    "center": true,
                    "scale": false,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "bn_data",
                "inbound_nodes": [
                    [
                        [
                            "data",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "name": "zero_padding2d_1646",
                    "trainable": true,
                    "dtype": "float32",
                    "padding": [
                        [
                            3,
                            3
                        ],
                        [
                            3,
                            3
                        ]
                    ],
                    "data_format": "channels_last"
                },
                "name": "zero_padding2d_1646",
                "inbound_nodes": [
                    [
                        [
                            "bn_data",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "conv0",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        7,
                        7
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "HeUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv0",
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_1646",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "bn0",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 2e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "bn0",
                "inbound_nodes": [
                    [
                        [
                            "conv0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "relu0",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "name": "relu0",
                "inbound_nodes": [
                    [
                        [
                            "bn0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "name": "zero_padding2d_1647",
                    "trainable": true,
                    "dtype": "float32",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "data_format": "channels_last"
                },
                "name": "zero_padding2d_1647",
                "inbound_nodes": [
                    [
                        [
                            "relu0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "pooling0",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                        3,
                        3
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "name": "pooling0",
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_1647",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "stage1_unit1_bn1",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 2e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "stage1_unit1_bn1",
                "inbound_nodes": [
                    [
                        [
                            "pooling0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "stage1_unit1_relu1",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "name": "stage1_unit1_relu1",
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_bn1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "name": "zero_padding2d_1648",
                    "trainable": true,
                    "dtype": "float32",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "data_format": "channels_last"
                },
                "name": "zero_padding2d_1648",
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_relu1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "stage1_unit1_conv1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "HeUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "stage1_unit1_conv1",
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_1648",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "stage1_unit1_bn2",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 2e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "stage1_unit1_bn2",
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "stage1_unit1_relu2",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "name": "stage1_unit1_relu2",
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_bn2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "name": "zero_padding2d_1649",
                    "trainable": true,
                    "dtype": "float32",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "data_format": "channels_last"
                },
                "name": "zero_padding2d_1649",
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_relu2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "stage1_unit1_conv2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "HeUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "stage1_unit1_conv2",
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_1649",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "stage1_unit1_sc",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "HeUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "stage1_unit1_sc",
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_relu1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add",
                "config": {
                    "name": "add_1238",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "add_1238",
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_conv2",
                            0,
                            0,
                            {}
                        ],
                        [
                            "stage1_unit1_sc",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "stage1_unit2_bn1",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 2e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "stage1_unit2_bn1",
                "inbound_nodes": [
                    [
                        [
                            "add_1238",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "stage1_unit2_relu1",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "name": "stage1_unit2_relu1",
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit2_bn1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "name": "zero_padding2d_1650",
                    "trainable": true,
                    "dtype": "float32",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "data_format": "channels_last"
                },
                "name": "zero_padding2d_1650",
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit2_relu1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "stage1_unit2_conv1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "HeUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "stage1_unit2_conv1",
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_1650",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "stage1_unit2_bn2",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 2e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "stage1_unit2_bn2",
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit2_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "stage1_unit2_relu2",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "name": "stage1_unit2_relu2",
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit2_bn2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "name": "zero_padding2d_1651",
                    "trainable": true,
                    "dtype": "float32",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "data_format": "channels_last"
                },
                "name": "zero_padding2d_1651",
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit2_relu2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "stage1_unit2_conv2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "HeUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "stage1_unit2_conv2",
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_1651",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add",
                "config": {
                    "name": "add_1239",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "add_1239",
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit2_conv2",
                            0,
                            0,
                            {}
                        ],
                        [
                            "add_1238",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "stage1_unit3_bn1",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 2e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "stage1_unit3_bn1",
                "inbound_nodes": [
                    [
                        [
                            "add_1239",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "stage1_unit3_relu1",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "name": "stage1_unit3_relu1",
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit3_bn1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "name": "zero_padding2d_1652",
                    "trainable": true,
                    "dtype": "float32",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "data_format": "channels_last"
                },
                "name": "zero_padding2d_1652",
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit3_relu1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "stage1_unit3_conv1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "HeUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "stage1_unit3_conv1",
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_1652",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "stage1_unit3_bn2",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 2e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "stage1_unit3_bn2",
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit3_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "stage1_unit3_relu2",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "name": "stage1_unit3_relu2",
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit3_bn2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "name": "zero_padding2d_1653",
                    "trainable": true,
                    "dtype": "float32",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "data_format": "channels_last"
                },
                "name": "zero_padding2d_1653",
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit3_relu2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "stage1_unit3_conv2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "HeUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "stage1_unit3_conv2",
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_1653",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add",
                "config": {
                    "name": "add_1240",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "add_1240",
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit3_conv2",
                            0,
                            0,
                            {}
                        ],
                        [
                            "add_1239",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "stage2_unit1_bn1",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 2e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "stage2_unit1_bn1",
                "inbound_nodes": [
                    [
                        [
                            "add_1240",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "stage2_unit1_relu1",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "name": "stage2_unit1_relu1",
                "inbound_nodes": [
                    [
                        [
                            "stage2_unit1_bn1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "name": "zero_padding2d_1654",
                    "trainable": true,
                    "dtype": "float32",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "data_format": "channels_last"
                },
                "name": "zero_padding2d_1654",
                "inbound_nodes": [
                    [
                        [
                            "stage2_unit1_relu1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "stage2_unit1_conv1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "HeUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "stage2_unit1_conv1",
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_1654",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "stage2_unit1_bn2",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 2e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "stage2_unit1_bn2",
                "inbound_nodes": [
                    [
                        [
                            "stage2_unit1_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "stage2_unit1_relu2",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "name": "stage2_unit1_relu2",
                "inbound_nodes": [
                    [
                        [
                            "stage2_unit1_bn2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "name": "zero_padding2d_1655",
                    "trainable": true,
                    "dtype": "float32",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
